In [85]:
import pandas as pd
df = pd.read_excel('06.xlsx',sheet_name=0)
df

     名称     开盘     最高     最低     收盘  行业
0  中国石油   8.03   8.10   7.98   8.03  石化
1  工商银行   6.06   6.11   6.03   6.05  银行
2  上海石化   3.00   3.03   2.98   2.98  石化
3  建设银行   7.91   8.00   7.86   7.92  银行
4  中国平安  56.90  57.48  55.80  55.80  保险
5  中芯国际  96.87  98.70  94.90  94.91  芯片

In [86]:
# 显式df.loc['行','列']
# TODO: 修改单个
# df.loc[0,'行业'] = '化石'
# df

In [87]:
# df.loc[0,'收盘'] = df.loc[0,'收盘']*5
# df

In [88]:
# TODO: 修改多个
df.loc[[0,2,3],['最高','最低']] = df.loc[[0,2,3],['最高','最低']]*5
df

     名称     开盘     最高     最低     收盘  行业
0  中国石油   8.03  40.50  39.90   8.03  石化
1  工商银行   6.06   6.11   6.03   6.05  银行
2  上海石化   3.00  15.15  14.90   2.98  石化
3  建设银行   7.91  40.00  39.30   7.92  银行
4  中国平安  56.90  57.48  55.80  55.80  保险
5  中芯国际  96.87  98.70  94.90  94.91  芯片

In [89]:
# 更改索引为某一列
df1 = df.set_index('名称')
df1

         开盘     最高     最低     收盘  行业
名称
中国石油   8.03  40.50  39.90   8.03  石化
工商银行   6.06   6.11   6.03   6.05  银行
上海石化   3.00  15.15  14.90   2.98  石化
建设银行   7.91  40.00  39.30   7.92  银行
中国平安  56.90  57.48  55.80  55.80  保险
中芯国际  96.87  98.70  94.90  94.91  芯片

In [90]:
# 修改多列
df1.loc[:,'收盘'] = df1.loc[:,'收盘']*10
df1

         开盘     最高     最低     收盘  行业
名称
中国石油   8.03  40.50  39.90   80.3  石化
工商银行   6.06   6.11   6.03   60.5  银行
上海石化   3.00  15.15  14.90   29.8  石化
建设银行   7.91  40.00  39.30   79.2  银行
中国平安  56.90  57.48  55.80  558.0  保险
中芯国际  96.87  98.70  94.90  949.1  芯片

In [91]:
df1.loc['工商银行':'中国平安','收盘'] = df1.loc[:,'收盘']+100
df1

         开盘     最高     最低     收盘  行业
名称
中国石油   8.03  40.50  39.90   80.3  石化
工商银行   6.06   6.11   6.03  160.5  银行
上海石化   3.00  15.15  14.90  129.8  石化
建设银行   7.91  40.00  39.30  179.2  银行
中国平安  56.90  57.48  55.80  658.0  保险
中芯国际  96.87  98.70  94.90  949.1  芯片

In [92]:
# 修改单行
df2 = df.set_index('名称')
df2.loc['工商银行','最高':'收盘'] += 30
df2

         开盘     最高     最低     收盘  行业
名称
中国石油   8.03  40.50  39.90   8.03  石化
工商银行   6.06  36.11  36.03  36.05  银行
上海石化   3.00  15.15  14.90   2.98  石化
建设银行   7.91  40.00  39.30   7.92  银行
中国平安  56.90  57.48  55.80  55.80  保险
中芯国际  96.87  98.70  94.90  94.91  芯片

In [93]:
df2.loc['工商银行'] = 'xxx'
df2

C:\Users\WZL\AppData\Local\Temp\ipykernel_4432\583786527.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'xxx' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df2.loc['工商银行'] = 'xxx'
C:\Users\WZL\AppData\Local\Temp\ipykernel_4432\583786527.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'xxx' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df2.loc['工商银行'] = 'xxx'
C:\Users\WZL\AppData\Local\Temp\ipykernel_4432\583786527.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'xxx' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df2.loc['工商银行'] = 'xxx'
C:\Users\WZL\AppData\Local\Temp\ipykernel_4432\583786527.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'xxx' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df2.loc['工商银行'] = 'xxx'

         开盘     最高    最低     收盘   行业
名称
中国石油   8.03   40.5  39.9   8.03   石化
工商银行    xxx    xxx   xxx    xxx  xxx
上海石化    3.0  15.15  14.9   2.98   石化
建设银行   7.91   40.0  39.3   7.92   银行
中国平安   56.9  57.48  55.8   55.8   保险
中芯国际  96.87   98.7  94.9  94.91   芯片

In [94]:
# 筛选字符串的数据
da = pd.read_excel('07.xlsx',sheet_name=0)
da

                       书名    价格  推荐指数
0  数据结构与算法分析(Python 语言描述)   68元    4星
1      Python 核心编程(第 3 版)   79元  4.5星
2           Python 从入门到实践  108元  4.8星
3              流畅的 Python   89元  4.2星
4         Python 机器学习基础教程   95元  4.1星
5           Python 网络编程基础   55元  3.8星
6    Python 自动化运维:技术与最佳实践   62元  4.7星

In [95]:
df1 = da[da.loc[:,'书名'].str.len()<15]
print(df1.loc[:,'书名'])
print(df1.loc[:,'书名'].str.len())
print(da.loc[:,'书名'].str.len()<15)

2    Python 从入门到实践
3       流畅的 Python
5    Python 网络编程基础
Name: 书名, dtype: object
2    13
3    10
5    13
Name: 书名, dtype: int64
0    False
1    False
2     True
3     True
4    False
5     True
6    False
Name: 书名, dtype: bool

In [104]:
# 函数筛选
# all() axis=1行
df[(df.loc[:,['开盘','收盘']]>56).all(axis=1)]

     名称     开盘    最高    最低     收盘  行业
5  中芯国际  96.87  98.7  94.9  94.91  芯片

In [106]:
# any() axis=1行
df[(df.loc[:,['开盘','收盘']]>56).any(axis=1)]

     名称     开盘     最高    最低     收盘  行业
4  中国平安  56.90  57.48  55.8  55.80  保险
5  中芯国际  96.87  98.70  94.9  94.91  芯片

In [115]:
# 需注意布尔值是行还是列，这对loc取值有影响
print(da.loc[:,lambda df:df.columns.str.len()==2])
print(da.loc[lambda da:da.loc[:,'书名'].str.len()<15])

                       书名    价格
0  数据结构与算法分析(Python 语言描述)   68元
1      Python 核心编程(第 3 版)   79元
2           Python 从入门到实践  108元
3              流畅的 Python   89元
4         Python 机器学习基础教程   95元
5           Python 网络编程基础   55元
6    Python 自动化运维:技术与最佳实践   62元
              书名    价格  推荐指数
2  Python 从入门到实践  108元  4.8星
3     流畅的 Python   89元  4.2星
5  Python 网络编程基础   55元  3.8星